CivilFilingClient/TestFiles/20161012/TestCorp2Individ.XML

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:tns2="http://webservice.civilfiling.ecourts.ito.aoc.nj/">
  <soapenv:Body>
    <tns2:submitCivilFiling>
      <arg0>
        <bulkFilingPacket>
          <attachmentList>
            <contentType>application/pdf</contentType>
            <docType>pdf</docType>
            <documentCode>CMPL</documentCode>
            <documentDescription>Complaint</documentDescription>
            <documentName>TestCorp2Individ</documentName>
            <extention>.pdf</extention>
          </attachmentList>
          <attorneyFirmId>F88888003</attorneyFirmId>
          <attorneyId>888888005</attorneyId>
          <attributes>
            <name>branchId</name>
            <value>0001</value>
          </attributes>
          <civilCase>
            <caseAction>028</caseAction>
            <courtSection>SCP</courtSection>
            <defendantCaption>defendantCaption not required</defendantCaption>
            <demandAmount>5400</demandAmount>
            <docketDetailsForOtherCourt>docketDetailsForOtherCourt</docketDetailsForOtherCourt>
            <juryDemand>N</juryDemand>
            <lawFirmCaseId>CorpVsIndividual</lawFirmCaseId>
            <otherCourtActions>Y</otherCourtActions>
            <plaintiffCaption>plaintiffCaption not required</plaintiffCaption>
            <serviceMethod>03</serviceMethod>
            <venue>ATL</venue>
            <venueOfIncident>CPM</venueOfIncident>
          </civilCase>
          <defendantList>
            <name>
              <firstName>Oliva</firstName>
              <lastName>Dunham</lastName>
              <middleName>K</middleName>
            </name>
            <partyAffiliation>HEI</partyAffiliation>
            <partyDescription>IND</partyDescription>
          </defendantList>
          <documentRedactionInd>Y</documentRedactionInd>
          <fee>
            <accountNumber>141375</accountNumber>
            <attorneyClientRefNumber>1</attorneyClientRefNumber>
            <exemptionReason>CO</exemptionReason>
            <feeExempt>Y</feeExempt>
            <paymentType>CG</paymentType>
          </fee>
          <plaintiffList>
            <adaAccommodationInd>N</adaAccommodationInd>
            <address>
              <addressLine1>123 Main Street</addressLine1>
              <city>Parsippany</city>
              <stateCode>NJ</stateCode>
              <zipCode>07054</zipCode>
            </address>
            <corporationName>Massive Dynamic</corporationName>
            <corporationType>CO</corporationType>
            <interpreterInd>N</interpreterInd>
            <partyAffiliation>ADM</partyAffiliation>
            <partyDescription>BUS</partyDescription>
          </plaintiffList>
        </bulkFilingPacket>
      </arg0>
    </tns2:submitCivilFiling>
  </soapenv:Body>
</soapenv:Envelope>